In [1]:
import numpy as np
import pandas as pd

In [9]:
df={'A':[1,2,np.nan],'B':[5,np.nan,6],'C':[1,2,3]}

In [10]:
df

{'A': [1, 2, nan], 'B': [5, nan, 6], 'C': [1, 2, 3]}

In [11]:
d=pd.DataFrame(df)

In [12]:
d

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  6.0  3

In [14]:
d.dropna(axis=1)   #axis=1 drops column null values

   C
0  1
1  2
2  3

In [15]:
d.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  6.0  3

In [16]:
df

{'A': [1, 2, nan], 'B': [5, nan, 6], 'C': [1, 2, 3]}

In [18]:
d.fillna(value='FILL NULLS')

            A           B  C
0           1           5  1
1           2  FILL NULLS  2
2  FILL NULLS           6  3

In [21]:
d['A'].fillna(value=1)

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

In [22]:
#group by

In [28]:
data={'Company':'APPLE FACEBOOK MICROSOFT APPLE FACEBOOK MICROSOFT'.split(),
      'Location':'Texas California Washington California Texas Texas'.split(),
      'Sales':[200,100,100,300,100,200]
}

In [29]:
data

{'Company': ['APPLE',
  'FACEBOOK',
  'MICROSOFT',
  'APPLE',
  'FACEBOOK',
  'MICROSOFT'],
 'Location': ['Texas',
  'California',
  'Washington',
  'California',
  'Texas',
  'Texas'],
 'Sales': [200, 100, 100, 300, 100, 200]}

In [30]:
df=pd.DataFrame(data)

df

     Company    Location  Sales
0      APPLE       Texas    200
1   FACEBOOK  California    100
2  MICROSOFT  Washington    100
3      APPLE  California    300
4   FACEBOOK       Texas    100
5  MICROSOFT       Texas    200

In [33]:
comp=df.groupby('Company')

In [40]:
comp.sum().loc['FACEBOOK']

Sales    200
Name: FACEBOOK, dtype: int64

In [42]:
df.groupby('Company').sum().loc['APPLE']

Sales    500
Name: APPLE, dtype: int64

In [51]:
df.groupby('Company').describe() #.loc['APPLE']    #.transpose()

Sales  count      2.000000
       mean     250.000000
       std       70.710678
       min      200.000000
       25%      225.000000
       50%      250.000000
       75%      275.000000
       max      300.000000
Name: APPLE, dtype: float64

In [52]:
#MERGING JOINING AND CONCAT

In [69]:
df1=pd.DataFrame({'A': 'A0 A1 A2 A3'.split(),
                  'B': 'B0 B1 B2 B3'.split(),
                  'C': 'C0 C1 C2 C3'.split(),
                  'D': 'D0 D1 D2 D3'.split(),
                 },
                 index=[0,1,2,3])

In [70]:
df2=pd.DataFrame({'A': 'A4 A5 A6 A7'.split(),
                  'B': 'B4 B5 B6 B7'.split(),
                  'C': 'C4 C5 C6 C7'.split(),
                  'D': 'D4 D5 D6 D7'.split(),
                 },
                 index=[4,5,6,7])

In [71]:
df3=pd.DataFrame({'A': 'A8 A9 A10 A11'.split(),
                  'B': 'B8 B9 B10 B11'.split(),
                  'C': 'C8 C9 C10 C11'.split(),
                  'D': 'D8 D9 D10 D11'.split(),
                 },
                 index=[8,9,1,11])

In [81]:
df4=pd.DataFrame({'A': 'A8 A9 A10 A11'.split(),
                  'B': 'B8 B9 B10 B11'.split(),
                  'C': 'C8 C9 C10 C11'.split(),
                  'D': 'D8 D9 D10 D11'.split(),
                 },
                 index=[8,9,1,11])

In [57]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [58]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [61]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
1   A10  B10  C10  D10
11  A11  B11  C11  D11

for concat please make sure that the dimensions match inorder to stack them up

In [62]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
1   A10  B10  C10  D10
11  A11  B11  C11  D11

Use axis=1 to transpose at the column level

In [64]:
df2=pd.concat([df1,df2,df3],axis=1)

In [66]:
df2.fillna('Null')

       A     B     C     D     A     B     C     D     A     B     C     D
0     A0    B0    C0    D0  Null  Null  Null  Null  Null  Null  Null  Null
1     A1    B1    C1    D1  Null  Null  Null  Null   A10   B10   C10   D10
2     A2    B2    C2    D2  Null  Null  Null  Null  Null  Null  Null  Null
3     A3    B3    C3    D3  Null  Null  Null  Null  Null  Null  Null  Null
4   Null  Null  Null  Null    A4    B4    C4    D4  Null  Null  Null  Null
5   Null  Null  Null  Null    A5    B5    C5    D5  Null  Null  Null  Null
6   Null  Null  Null  Null    A6    B6    C6    D6  Null  Null  Null  Null
7   Null  Null  Null  Null    A7    B7    C7    D7  Null  Null  Null  Null
8   Null  Null  Null  Null  Null  Null  Null  Null    A8    B8    C8    D8
9   Null  Null  Null  Null  Null  Null  Null  Null    A9    B9    C9    D9
11  Null  Null  Null  Null  Null  Null  Null  Null   A11   B11   C11   D11

In [72]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
1   A10  B10  C10  D10
11  A11  B11  C11  D11

In [84]:
#Merge

pd.merge(df3,df4,how='inner',on='A')

     A  B_x  C_x  D_x  B_y  C_y  D_y
0   A8   B8   C8   D8   B8   C8   D8
1   A9   B9   C9   D9   B9   C9   D9
2  A10  B10  C10  D10  B10  C10  D10
3  A11  B11  C11  D11  B11  C11  D11

In [90]:
#Operations

df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':'abc def ghi jkl'.split()
    
})

In [91]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [92]:
df.nunique()

col1    4
col2    3
col3    4
dtype: int64

In [93]:
df['col2'].nunique()

3

In [94]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [97]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  jkl

Apply is used to apply any custom functions created by the user of using the lambda expressions

In [101]:
#Apply

def times2(x):
    return x*2

In [102]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Lambda is used instead of creating a function

In [106]:
df['col1'].apply(lambda x:x*4)

TypeError: <lambda>() got an unexpected keyword argument 'inplace'

In [109]:
df.drop('col1',axis=1) #inplace=True to make the change permanent

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl

In [112]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [115]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [117]:
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

In [118]:
#PIVOT
data={'A':'foo foo foo bar bar bar'.split(),
      'B':'one one two two one one'.split(),
      'C':'x y x y x y'.split(),
      'D':[1,2,3,4,5,6]
}

In [119]:
df=pd.DataFrame(data)

In [120]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  4
4  bar  one  x  5
5  bar  one  y  6

In [122]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  5.0  6.0
    two  NaN  4.0
foo one  1.0  2.0
    two  3.0  NaN

In [123]:
df.pivot_table(values='D', index=['A'])

     D
A
bar  5
foo  2